app/views/food_items/new.html.erb

SELECT "categories".* FROM "categories"
---
      <th>Category</th>
      <td><%= f.collection_select(:category_id, Category.all, :id, :name, { :prompt => 'Select a Category', :selected => @foodItem.category_id }, { class: 'form-control' }) %></td>