app/controllers/food_items_controller.rb

SELECT "food_items".* FROM "food_items"
---
  def index
    @foodItems = FoodItem.all

SELECT "food_items".* FROM "food_items" WHERE "food_items"."id" = 1 LIMIT 1
---
  def show
    @foodItem = FoodItem.find(params[:id])

INSERT INTO "food_items" ("name", "category_id", "created_at", "updated_at") VALUES (NULL, NULL, '2016-01-27 03:56:35.000000', '2016-01-27 03:56:35.000000')
---
  def create
    # Instantiate a new object using form parameters
    @foodItem = FoodItem.new(food_items_params)
    # Save the object
    if @foodItem.save

SELECT "food_items".* FROM "food_items" WHERE "food_items"."id" = 1 LIMIT 1
---
  def edit
    @foodItem = FoodItem.find(params[:id])

SELECT "food_items".* FROM "food_items" WHERE "food_items"."id" = 1 LIMIT 1
---
  def update
    # Instantiate a new object using form parameters
    @foodItem = FoodItem.find(params[:id])